IDENTIFICATION DIVISION.
PROGRAM-ID. P3.
AUTHOR. Walter Cueva.
DATA DIVISION.
WORKING-STORAGE SECTION.
01  ACUM      PIC 9(4) VALUE 1.
01  INCR      PIC 9 VALUE 1.
01  CONT      PIC 9(3) VALUE 6.
PROCEDURE DIVISION.
*>procedimiento principal
PERFORM calcula CONT TIMES.
DISPLAY ACUM.
STOP RUN.
calcula.
MULTIPLY ACUM BY INCR GIVING ACUM.
ADD 1 TO INCR.
DISPLAY ACUM.
